{
  "name": "Forien's Lore",
  "_id": "Gkp2fY7NEJJ3FlGe",
  "pages": [
    {
      "sort": 100000,
      "name": "The Hunters' Guild",
      "type": "text",
      "_id": "lgV5sjVAWAZN1WCk",
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<h2>The Guild</h2><p style=\"text-align:justify\">Nestled within the untamed heart of the Empire, where the forests echo with the haunting calls of beasts and the mountains stand as silent sentinels against the unknown, a fortress of the Hunters' Guild rises as a bastion against the encroaching darkness. Far removed from the hustle of urban life, this formidable stronghold is a testament to the Guild's commitment to defending humanity from the monstrous threats that lurk in the wilderness.</p><p style=\"text-align:justify\">Perched strategically at the edge of the Drakwald Forest, surrounded by towering peaks, the fortress is both a training ground and a haven for those who willingly embrace the perilous path of the Hunter. Its imposing walls and watchtowers stand as a symbol of defiance against the unknown, while the dense foliage and treacherous terrain deter all but the most determined seekers of its secrets.</p><p style=\"text-align:justify\">The heart of the fortress is the Grand Lodge, a massive hall where the <em>Master Beaststalker</em> plans and strategizes, surrounded by maps marked with reported monster sightings and the intricate details of each Hunter's quarry. Dormitories echo with the camaraderie of warriors sharing tales of their conquests, and the blacksmith's forge burns day and night, crafting weapons imbued with runes to pierce the hide of the most formidable foes.</p><p style=\"text-align:justify\">Surrounding the fortress is a sprawling training ground, where Hunters hone their skills in combat against mechanized monstrosities crafted by ingenious engineers. The air resonates with the clanging of steel, the crackling of magic, and the occasional roar of captured creatures used for practical training, all under the watchful eyes of seasoned instructors.</p><p style=\"text-align:justify\">To become a member of the Hunters' Guild is to undertake a pilgrimage to this fortress, guided by old maps and whispered rumors. Those who survive the trials and prove their mettle are welcomed into the fold, bearing the emblem of the Guild — a stylized monster skull etched onto their gear. </p><p></p><h2>Official status</h2><p>While the existence of the Hunters' Guild is not widely known throughout the Empire, the Guild is fortunate to enjoy the protection and blessing of the Emperor. On occasion, the Guild may even receive requests from Elector Counts or other landowners to handle monster-related issues, often in exchange for a substantial donation.</p><p>This fortunate standing renders the Guild a relatively secure refuge for Runebounds. Technically classified as mutants, much to the chagrin of the Inquisition, they find protection as long as they maintain employment with the Hunters' Guild.</p><p></p><h2>Organizational structure</h2><p>The Guild operates as an authoritative organization, led by the Master Beaststalker. Directly below the him are the Alpha Hunters, each serving as the leader of a Hunting Company. Together, they constitute the Council of the Hunt. In the event of a vacancy in the position of Master Beaststalker, the Council selects a new leader through a voting process.</p><p>Hunting Companies exhibit a diverse range of sizes, structures, member counts, and skill levels. They lack uniformity, with some focusing on specific monsters, while others play more supportive or logistical roles. What is common between them is that each Company is under the leadership of an Alpha Hunter — an exceptionally experienced individual who has endured countless encounters thanks only to their prowess and accumulated knowledge.</p><p>Normally, a member of one Company only answers to their superiors within the same Company and the Master Beaststalker. </p><p></p><h2>Notable members</h2><p><em>tba</em></p><p></p><h2>Fighting Styles</h2><p>In its nascent stages, the Hunters' Guild lacked a unified combat style, with each Hunter functioning as an individual without any cohesive training. This decentralized approach swiftly proved inefficient and, more often than not, perilous. In response to this, three distinct fighting styles gradually emerged over time, each strategically honed to address specific challenges posed by various adversaries.</p><p>Initially, some of the more traditional Companies adhered strictly to a single combat style, imparting its nuances to all their members. However, as the Guild evolved, ushering in a new era of open-mindedness, forward-thinking Alpha Hunters recognized the limitations of this singular approach. Opting for a more progressive strategy, these innovative leaders began diversifying their Companies by integrating all three styles. This forward-thinking approach resulted in the formation of small yet highly effective units, where every Hunter compensated for their comrades' shortcomings. This harmonious integration of styles not only enhanced the adaptability of the Guild but also elevated its collective strength, ensuring a more nuanced and formidable response to the diverse array of monstrous threats they faced.</p><p></p><h3>Steelstorm Assault</h3><p>The @UUID[Compendium.forien-armoury.forien-armoury.Item.O987u5M0SL46gm3v]{Steelstorm Assault} style originated from the Guild's encounters with monstrous entities that demanded swift and overwhelming force. In the face of these formidable foes, Hunters who exhibited a preference for charging into the heart of battle with relentless fury became the forefront warriors of this style. Masters of the Steelstorm Assault embrace the ethos of striking first and striking hard, unleashing an initial onslaught that leaves opponents battered and bewildered. These aggressive combatants, likened to the thunderstorm's fury, became a formidable force within the Guild. Their distinct approach to combat evolved as a strategic response to the need for swift and decisive action against the most formidable adversaries that the Guild encountered.</p><p></p><h3>Ironshield Ward</h3><p>The @UUID[Compendium.forien-armoury.forien-armoury.Item.Da4zReU57OnesKGd]{Ironshield Ward} style found its genesis in the Guild's recognition of the need for stalwart defenders capable of holding the line against relentless adversaries. As the Guild faced monstrous foes with formidable strength, it became evident that a specialized defensive style was essential. Hunters who demonstrated exceptional skill in parrying, riposting, and executing precise counterattacks were identified as the vanguard defenders. Their unyielding strength and disciplined precision in turning aside blows and repelling adversaries earned them the distinction of being the embodiment of the empire's defenses. Over time, these defenders naturally formed a core group within the Guild, specializing in the art of protective combat.</p><p></p><h3>Shrewd Evadecraft</h3><p>The @UUID[Compendium.forien-armoury.forien-armoury.Item.CUWdlx3IhkmTPL57]{Shrewd Evadecraft} style emerged as a response to the Guild's encounters with cunning and elusive monsters that required more than brute force to defeat. Hunters who excelled in outsmarting their adversaries, demonstrating nimble dodging skills, and displaying keen observation in the midst of chaos became the pioneers of this fighting style. Their adaptive survival techniques evolved through a continuous process of learning from encounters with unpredictable foes. Within the Guild, these agile orchestrators naturally coalesced, forming a distinctive group known for their calculated finesse in navigating the complex and ever-changing dance of battle.</p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1,
        "ZJyAmf2sKocHG1ud": 3
      },
      "flags": {},
      "_stats": {
        "systemId": "wfrp4e",
        "systemVersion": "7.0.3",
        "coreVersion": "12.327",
        "createdTime": 1702393297905,
        "modifiedTime": 1702395580418,
        "lastModifiedBy": "ZJyAmf2sKocHG1ud",
        "compendiumSource": null,
        "duplicateSource": null
      },
      "_key": "!journal.pages!Gkp2fY7NEJJ3FlGe.lgV5sjVAWAZN1WCk"
    },
    {
      "sort": 200000,
      "name": "Runebounds",
      "type": "text",
      "_id": "3Xv2geVQ88IDZ8Ey",
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<h2>Origin</h2><p>A several dozens of years ago, in the shadowed corridors of the Hunters' Guild, where the pursuit of mastery over monsters knew no bounds, a controversial and secretive initiative has taken root. With the goal of forging ultimate warriors to combat the relentless Chaos Beasts and the ceaseless hordes of Undead, some enterprising individuals within the Guild have delved into the forbidden realm of Runebinding.</p><p>The process began in total secret, even from the Guild's leader. Researchers abducted orphans to experiment on with no regard to their wellbeing and survivability. Eventually, after countless \"failures\", they succeeded. The result was the birth of three original Runebounds — beings where magic and mortal are indistinguishably entwined. They were named Harkyn, Yuro and Fysh, originally orphans from Middenheim. </p><p>This magical infusion doesn't merely grant the Runebound new abilities; it transforms them into something beyond human. They become living conduits of magic, capable of wielding spells with a finesse unmatched by conventional mortals. However, the price of this power is steep — the loss of their humanity, as many outside the Guild see them as nothing more than mutants, heretics, or monsters to be hunted.</p><p>Upon discovery by the Council, it stood as a testament to fortune that the researchers, teetering on the edge of heresy, were not summarily executed alongside their arcane creations. Now, under stringent scrutiny, the Runebinding process underwent a meticulous refinement, evolving to a stage where willing participants stood a relative chance of surviving the transformative ordeal. However, a glaring truth emerged: the older the individual, the more perilous the journey through the transition, underscoring the inherent risks woven into the very fabric of this mystical metamorphosis.</p><h2>Process nowadays</h2><p>Within the Guild, the creation process of Runebounds remains a closely guarded secret. Only the most seasoned and trustworthy individuals are privy to the details of this experimental program. Runebounds, though potent allies against the forces of darkness, navigate a precarious existence within the Guild. While their powers are indispensable, they face the disdain of those who question the morality and wisdom of tampering with the very fabric of humanity. As Runebounds continue to emerge as a controversial asset in the Guild's arsenal, the delicate balance between wielding their formidable abilities and managing the societal backlash becomes an ongoing challenge for the Guild's leadership.</p><p>Guild actively discourages any individual from undergoing the process, but there is no shortage of young, strong-willed volunteers. </p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "system": {},
      "ownership": {
        "default": -1,
        "ZJyAmf2sKocHG1ud": 3
      },
      "flags": {},
      "_stats": {
        "systemId": "wfrp4e",
        "systemVersion": "7.0.3",
        "coreVersion": "12.327",
        "createdTime": 1702395997199,
        "modifiedTime": 1702396980332,
        "lastModifiedBy": "ZJyAmf2sKocHG1ud",
        "compendiumSource": null,
        "duplicateSource": null
      },
      "_key": "!journal.pages!Gkp2fY7NEJJ3FlGe.3Xv2geVQ88IDZ8Ey"
    }
  ],
  "folder": null,
  "sort": 0,
  "ownership": {
    "default": 0,
    "ZJyAmf2sKocHG1ud": 3
  },
  "flags": {},
  "_stats": {
    "systemId": "wfrp4e",
    "systemVersion": "7.0.3",
    "coreVersion": "12.327",
    "createdTime": 1702393289299,
    "modifiedTime": 1702396980332,
    "lastModifiedBy": "ZJyAmf2sKocHG1ud",
    "compendiumSource": null,
    "duplicateSource": null
  },
  "_key": "!journal!Gkp2fY7NEJJ3FlGe"
}
