{
  "sort": 0,
  "name": "Intro",
  "type": "text",
  "_id": "9XxeTpJTh6hE9guG",
  "title": {
    "show": true,
    "level": 1
  },
  "image": {},
  "text": {
    "format": 1,
    "content": "<p>This is a compilation of my Houserules that I use when running WFRP4e.</p><p></p><p>Not all rules are polished and I don't consider them \"ready for publication\", especially the Alchemy Crafting Recipes. But I included them anyway, because maybe some of you will have a great idea on how to improve it.</p><p></p><p><strong>If you are a Player</strong>, keep in mind that everything in this Journal (and in fact – in my entire module) is considered <em>Homebrew</em>, <em>non-official</em> and entirely <em>optional</em>. If you want to use anything from this Journal or Module, consult your GM.</p><p></p><h2>Contributions</h2><p>If you have an idea for a rule, item, career, whatever, or you have a suggestion for a change of something, feel free to open a GitHub \"issue\", pick a proper template and post your ideas/suggestions there.</p><p>If you want to contribute more directly, feel free to open a Pull Request on GitHub, but please describe it properly as well.</p><p>I'm also accepting opinions on balancing.</p><p></p><p></p><h2>Disclaimer</h2><p>Some of these rules were handcrafted by me, others I found on the Internet (most likely in the Rat Catchers Guild's Discord).</p><ul><li><p>For example, some of the Combat Rules or Psychology option during Character Creation I took from the <a href=\"https://docs.google.com/document/d/1v37KH8Pa1BjTfnH4QT_N4_MGK3seKMvkvQKnWiJ4u3A/edit#heading=h.pwgx5uout2ji\">Unofficial FAQ</a> under an assumption of Public Domain / Fair Use.</p></li><li><p>I've made Runesmiths with inspirations taken from Polish rulebook of WFRP 2nd Edition \"Realm of Sorcery\" and Rune names are what I believe the official English names for the Runes from 2nd Edition. So all credit for the general vision and naming goes to respective companies (Black Industries and Copernicus Corporation).</p><ul><li><p>However, all the descriptions related to Runesmith career and rules are written by me.</p></li></ul></li><li><p>I implement multiple items mentioned in the official Rulebooks that either are not implemented in official Modules (for example @UUID[Compendium.forien-armoury.forien-armoury.Item.RN5mc97zk1Bd7jRx]{Improved Bullet and Powder}), or lack certain features (for example @UUID[Compendium.forien-armoury.forien-armoury.Item.wTi7GD0yyAFZdfkc]{Lantern}). In these cases I link to original content mentioning said Item and all credit goes to the original authors.</p></li><li><p>Some descriptions and quotes were generated using ChatGPT, because English is not my native language and I wanted some text to be written better than I could have done.</p><ul><li><p>For example, fluff quotes at the top of each Career were generated</p></li><li><p>More often than not, I've written a draft myself and only asked ChatGPT to rewrite it, or \"improve\" on it in order to \"make it syntactically and grammatically correct\". </p></li><li><p>This allows me to create nice and colorful descriptions that I otherwise would not be able to</p></li></ul></li></ul><p><em>No infringement was ever intended by me, if by any chance your original work ended up as a part of my module, please contact me and I will remove your copyrighted work from it.</em></p><p></p><p></p><h2>Acknowledgments</h2><p><em>Disclaimer: I kept all acknowledgments, even if their respective work was lost during the Module's remake. Sorry for that.</em></p><ul><li><p>Thanks to <strong>Atropos</strong> for his relentless work on developing and improving the <strong>Foundry VTT</strong></p></li><li><p>Thanks to <strong>Moo Man</strong> for his great work developing the <strong>WFRP4e</strong> game system as well as for his invaluable help with understanding how to mod Foundry using JS</p></li><li><p>Thanks to <strong>Thoradin</strong> for an idea for arrow reclamation feature :)</p></li><li><p>Thanks to <strong>Nibbler </strong>from The Rat Catchers Guild discord server for providing various @UUID[.aQ7pHrVuoyA5r3m6]{price tables}</p></li><li><p>Thanks to <strong>VividOblivion</strong> for proposing and designing a @UUID[Compendium.forien-armoury.forien-homerules.JournalEntry.u2f4n9KXYBmBvZw3.JournalEntryPage.LnfVke9w0gwL3Qle#casting-fatigue]{Casting Fatigue} rule!</p></li><li><p><em>[Legacy]</em> Thanks to <strong>DasSauerkraut</strong> for allowing me to integrate compendium from his Gerwin Waffenhalter’s Magnificent Weapons Gallery into my module</p></li><li><p><em>[Legacy]</em> Thanks to <strong>LeRatierBretonnien</strong> and <strong>Gharazel</strong> for providing French translation!</p></li><li><p><em>[Legacy]</em> Thanks to <strong>ElCamino</strong> for providing German translation!</p></li></ul><p></p><h2>Support</h2><p>If you wish to support me, please consider becoming my <a href=\"https://www.patreon.com/forien\">Patreon</a> or donating through <a href=\"https://www.paypal.com/cgi-bin/webscr?cmd=_s-xclick&amp;hosted_button_id=6P2RRX7HVEMV2&amp;source=url\">Paypal</a>. Thanks!</p><p></p><h2>Licensing</h2><p><em>Module is available under MIT License, however, please bear in mind that parts of the module (for example some icons) are included based on separate licenses and <strong>must not</strong> be extracted, distributed or used separately from the module.</em></p><p><em>To the best of my knowledge, all content in this module is either made by me, licensed to me, publicly available under permissive license or falls under Fair Use. Please bring infractions or concerns related to my module to my attention by contacting me via email presented on my GitHub profile.</em></p>"
  },
  "video": {
    "controls": true,
    "volume": 0.5
  },
  "src": null,
  "system": {},
  "ownership": {
    "default": -1,
    "ZJyAmf2sKocHG1ud": 3
  },
  "flags": {},
  "_stats": {
    "systemId": "wfrp4e",
    "systemVersion": "7.0.3",
    "coreVersion": "11.315",
    "createdTime": 1689006089965,
    "modifiedTime": 1702515746471,
    "lastModifiedBy": "ZJyAmf2sKocHG1ud"
  },
  "_key": "!journal.pages!u2f4n9KXYBmBvZw3.9XxeTpJTh6hE9guG"
}