{
  "sort": 62500,
  "name": "Module's features",
  "type": "text",
  "_id": "LnfVke9w0gwL3Qle",
  "title": {
    "show": true,
    "level": 1
  },
  "image": {},
  "text": {
    "format": 1,
    "content": "<p>This module offers a lot of features that may not be apparent by just looking at the content compendiums. Here I will try to present and explain them.</p><p>Keep in mind than many of these features needs to be first <strong>enabled</strong> in the module @UUID[Compendium.forien-armoury.macros.Macro.q6ITACXwRU45kTcR]{Settings Configuration}, where you can also find many options to <strong>customize</strong> how the module works!.</p><p></p><h2>Arrow Reclamation</h2><p>This feature is <strong>disabled by default</strong>.</p><p>Allows players to recover some portion of their fired arrows, bolts and sling bullets after the combat ends. Must be enabled in @UUID[Compendium.forien-armoury.macros.Macro.q6ITACXwRU45kTcR]{settings}, where you can also find additional configuration of this feature, such as choice of reclamation rules, chances and what type of ammunition allow to be recovered.</p><p></p><h2>Runes</h2><p>This feature is <strong>always running.</strong></p><p>Whenever any temporary \"Rune\" (by which this module calls Active Effects that represent Dwarven Magic Runes) is disabled, the module will automatically delete it from the item.</p><p>This feature works with all shipped Runes as well as your custom one if they follow the <code>Rune of ABC (Temporary)</code> naming convention.</p><h3>Destroyed Runes Damage Item</h3><p>This feature is <strong>disabled by default.</strong></p><p>Additionally, in module's @UUID[Compendium.forien-armoury.macros.Macro.q6ITACXwRU45kTcR]{settings}, you can enable another rune feature, which causes destroyed Runes to cause 1 Damage to the item.</p><p></p><h2>Magic Scrolls</h2><p>This feature is <strong>always running.</strong></p><p>Thanks to WFRP4e transition to Data Models in 7.1.0, modules can now more easily create custom Item <strong>types</strong>. Yes, no longer we are forced to do shenanigans or hijack existing types. </p><p>Because of that I was able to introduce concept of <strong>Magic Scroll</strong> type Item. This Item type is derivative of <strong>Physical Item</strong>, meaning it's like a Trapping. What makes it very powerful is that you can drag&amp;drop a Spell onto a Magic Scroll, which will attach one to another.</p><p>Magic Scrolls can be written in any language and then they can be used by any character who knows that language, allowing them to cast a Spell <em><strong>from</strong></em> the Scroll, without having to temporarily add Spell Item to Actor. </p><p>Check @UUID[Compendium.forien-armoury.macros.Macro.q6ITACXwRU45kTcR]{settings} for more customization on how Magic Scrolls behave.</p><p></p><h2>Checking Careers</h2><p>In Macro Compendium, you can find the @UUID[Compendium.forien-armoury.macros.Macro.MrggtmSEdMnNgOL2]{Check Careers! (all)} and @UUID[Compendium.forien-armoury.macros.Macro.X6PfKZ7ycRJhb6yX]{Check Career!} macros.</p><p>When used, they allow GM and Players to easily check their career and progress and quickly see how many Characteristics, Skills and Talents they already have and what they are missing in order to <strong>complete current career</strong>.</p><p></p><h2>Combat Fatigue</h2><p>This feature is <strong>disabled by default</strong>.</p><p>Implementing optional ruleset \"Getting Tired\" (found @UUID[Compendium.wfrp4e-core.journals.JournalEntry.NS3YGlJQxwTggjRX.JournalEntryPage.SjuV1vgbgM49pFpP#master-condition-list]{here}), this feature will prompt characters to roll an Endurance Test after TB rounds they spend in combat. This feature can be disabled for NPCs.</p><p><strong>Please note</strong> that this feature affects <em><strong>all</strong></em> Actors in Combat that have and end their turns. It has no idea if those Actors are performing intensive tasks during those turns.</p><p></p><h2>Casting Fatigue</h2><p>This feature is <strong>disabled by default.</strong></p><p>This feature has been proposed and designed by Discord user <strong>VividOblivion.</strong></p><p></p><h3>Manipulating the winds of magic is difficult.</h3><p>Whenever a caster attempts a <strong>Casting Test</strong>, the spell's CN is subtracted from the caster's <strong>Magical Endurance</strong>. Furthermore, any <strong>Channeling</strong> attempt subtracts 1* from the caster's Magical Endurance. A caster's Magical Endurance is equal to his <strong>TB × WPB</strong>*.</p><p>When Magical Endurance drops below 0 the caster must pass a <strong>Challenging (+0) Endurance Test</strong> or receive a @Condition[Fatigued] condition. This difficulty of this Test increases by one step for every 5* Magical Endurance below 0.</p><p>Every caster will <strong>passively regenerate</strong> their Magical Endurance in a rate of their <strong>Willpower Bonus</strong> per hour**.</p><p><em>* This is suggested value, but is configurable via Module's Settings</em></p><p><em>** This can be automated in @UUID[Compendium.forien-armoury.macros.Macro.q6ITACXwRU45kTcR]{Settings Configuration}, when coupled with a time tracking module (such as Simple Calendar)</em></p><p></p><h2>Item Repair</h2><p>In Macro Compendium, you can find the @UUID[Compendium.forien-armoury.macros.Macro.Qk0VNcvb77ANwSQY]{Check Equipment for Repairs} and @UUID[Compendium.forien-armoury.macros.Macro.as22aZ3wJdi5EATf]{Check Equipment for Repairs (Free)} macros.</p><p>They allow players to create a Chat Card that will outline every damaged item in their character's possesion, with ability to interactively repair them using buttons and automatic price calculation.</p><p>More examples of Item Repair macros, that are more narrowed in function can be found in <strong>[Macros -&gt; Integrations -&gt; Item Piles]</strong> Folder</p><p></p><h2>Automated Disease Progression</h2><p>This feature is <strong>disabled by default</strong>.</p><p>When coupled with a time tracking module (such as <a href=\"https://foundryvtt.com/packages/foundryvtt-simple-calendar\" target=\"_blank\">Simple Calendar</a>), and enabled in the module's @UUID[Compendium.forien-armoury.macros.Macro.q6ITACXwRU45kTcR]{Settings Configuration}, this feature will automatically countdown the Diseases' \"incubation\" and \"duration\" values. When a Disease's \"incubation\" reaches 0, it will activate, its symptoms will appear and the \"duration\" will start counting down.</p><p></p><h2>Item Properties</h2><p>This feature is <strong>always running</strong>.</p><p><sup>If you do not wish to use these properties, simply do not use them or items that have them. You can also edit the items (import them first) to remove those properties.</sup></p><p></p><h3>New Qualities</h3><ul><li><p><strong>Blinding</strong> – A Blinding X weapon inflicts X @Condition[Blinded] Conditions to enemy hit.</p></li><li><p><strong>Incendiary</strong> – An Incendiary X weapon inflicts one @Condition[Ablaze] Condition on hit, as long as unit die on the Weapon Test rolled less than or equal X.</p></li><li><p><strong>Poisonous</strong> – A weapon with Poisonous X inflicts one @Condition[Poisoned] Condition whenever attacker scores at least X SL on Weapon Test.</p></li><li><p><strong>Recoverable</strong> – Projectile can be recovered even if it's ammunition group normally cannot. <sup>(requires feature enabled in settings)</sup></p></li><li><p><strong>Slashing</strong> – A weapon with Slashing X inflicts one @Condition[Bleeding] Condition on a successful hits on locations protected by no more than X Armour Points.</p></li></ul><p></p><h3>New Flaws</h3><ul><li><p><strong>Unrecoverable</strong> – Projectile always perishes and can never be recovered.</p></li></ul>"
  },
  "video": {
    "controls": true,
    "volume": 0.5
  },
  "src": null,
  "system": {},
  "ownership": {
    "default": -1,
    "ZJyAmf2sKocHG1ud": 3
  },
  "flags": {},
  "_stats": {
    "systemId": "wfrp4e",
    "systemVersion": "7.1.3",
    "coreVersion": "11.315",
    "createdTime": 1701641007051,
    "modifiedTime": 1714399568878,
    "lastModifiedBy": "rTgnwDbJCJYDenyf"
  },
  "_key": "!journal.pages!u2f4n9KXYBmBvZw3.LnfVke9w0gwL3Qle"
}