{
  "sort": 600000,
  "name": "New Magic Rules",
  "type": "text",
  "_id": "MJssx3cDKIqZVdXq",
  "title": {
    "show": false,
    "level": 1
  },
  "image": {},
  "text": {
    "format": 1,
    "content": "<h1>Runebound Magic</h1><p>Runebound magic is innate ability of the Runebound, artificially enhanced Humans. However, not every Runebound can use the magic and even among those that can, not all are proficient at the same level.</p><p>Unlike Arcane Magic, Runebound Magic does not require spoken chants. It uses @UUID[Compendium.wfrp4e-core.skills.Item.V8eRx66SxB9Jha0Q]{Channelling} to gather and move Winds through the body and form spells by hand signs and gestures. Therefore, a Runebound wanting to use Runebound Magic (called Runes or Runebound Spells) <strong>needs to have at least one hand free</strong>.</p><ul><li><p>Runes can be cast and channelled. Both actions use the same skill.</p></li><li><p>Runes can be dispelled as any other magic.</p></li><li><p>All Runes count as magical source of damage.</p></li><li><p>Runes can only be accessed when talent Runebound Magic is purchased</p></li><li><p>\"Memorized\" Runes can be cast using Free Action</p><ul><li><p>@UUID[Compendium.wfrp4e-core.talents.Item.tXKX29QZBdHmyMc7]{Combat Reflexes} Talent allows to use Runes while using two-handed weapons (of any Category). This reflects the required reflexes to quickly use one hand to form a Rune while using two-handed weapons without any penalties.</p></li><li><p>Runes can only be Memorized through the Runebound Magic Talent</p></li></ul></li></ul><p></p><h2>Runebound Spells</h2><p>Runebound Spells, also known as Runes are quite unique. On the power level, they are not that much stronger than Petty Spells, but they can be Channelled, Memorized and Overcast, making them more akin to Arcane Spells.</p><ul><li><p>Fax – Fire</p></li><li><p>Claustra – Lock</p></li><li><p>Tutor – Ward</p></li><li><p>Tego – Conceal</p></li><li><p>Lepos – Allure</p></li><li><p>Sopio – Lull</p></li><li><p>Pulso – Push</p></li></ul><p></p><p></p><h1>Dwarven Runes</h1><h2>Rules for Runes</h2><h3>Rule of Three</h3><p>Maximum of three Runes can be engraved on a single item.</p><h3>Rule of Pride</h3><p>Runesmiths don't like repeating itself and they treat their work with utmost respect. Unless very specific circumstances, they will not make an item identical to one they already made.</p><h3>Rule of Time</h3><p>Only one Rune can be worked on at the same time.</p><h3>Rule of Form</h3><p>Runes must be engraved on an item of appropriate type. Furthermore, they need to be carved in a solid, resilient substance like metal, wood, bone and stone. Soft and brittle materials like leather, fabric, paper, ceramic are not suitable for the Art of Runecrafting!</p><h3>Rule of Mastery</h3><p>Master Runes are too powerful to share an artifact with other runes. Master Runes count as 3 Runes for the purpose of Rule of Three.</p><p></p><h2>Cr<strong>eat</strong>ing a Rune</h2><p>To be able to create a rune, a character must meet these requirements:</p><ul><li><p>Must be a dwarf,</p></li><li><p>Must have a Runecraft skill,</p></li><li><p>Must know a Rune; either by using a Dawi Runes talent or by having exact recipe to read,</p></li><li><p>Must have a Language (Magick) skill,</p></li><li><p>Must have a workshop and tools.</p></li></ul><p></p><p>Creating runes happens in three steps:</p><ol><li><p><strong>Engraving</strong> — Runesmith needs to engrave runes on the item, it requires a <strong>Dramatic Challenging (+0) Art (Engraving) Test</strong>, where any success allows for a temporary rune and an Impressive Success (+4 SL) allows for a permanent rune. Process takes 4 hours.</p><ul><li><p>Engraving Master Runes requires an Astounding Success (+6 SL) for Permanent effect and a Success (+3 SL) for a Temporary effect</p></li></ul></li><li><p><strong>Empowering</strong> — Runesmith needs to fill the rune with magical power. To do this, an <strong>Extended Runecrafting Test</strong> with target SL being the Power statistic found in the specific rune's description. For permanent runes, the target SL is 10 times higher. Every Test represents one hour of work and Runesmith can only Empower the Rune for a maximum of Willpower Bonus hours a day.</p><ul><li><p>Optionally — Empowering Permanent Runes may require Rune's Power SL, but then each Test represents a Week of daily work</p></li></ul></li><li><p><strong>Binding</strong> — Runesmith needs to bind the power in the rune and close it. This step does not require a Test, only time. Time is equal to Rune's Power days for permanent Runes and Rune's Power x10 minutes for temporary Runes.</p></li></ol><p></p><h2>Ways to Fail</h2><p>There are number of ways a Runecrafting can fail. Here are some examples, but as always, GM's choice:</p><ol><li><p>During Engraving, if test fails, an Item receives 1 Damage (if applicable) and Runecrafting cannot be performed on that item unless it's repaired/mended. If test results in a Fumble, Item receives cannot be Engraved even when repaired/mended.</p></li><li><p>When Empowering, a Fumble during any roll of the Extended Test results in a \"Failed Empowering Attempt\" and the effect can range from \"just wasted time\" through \"weapon explodes\" to a \"spawn of chaos\". GM's choice really. <em><strong>[Maybe To Do a Rollable Table]</strong></em></p></li><li><p>When Binding a Permanent Rune, if a Runesmith skip a day, there is a chance that power of the Rune dissipates and Rune immediately changes into a Temporary one. There is also a chance that power will explode, injuring Runesmith on the next attempt.</p></li></ol><p></p><h2>Runes</h2><p>Runes have the following description:</p><p><strong>Name:</strong> Rune's name<br><strong>Type:</strong> Rune's type, determines on what kind of Item it can be Engraved (Weapon, Armour, Talismanic).<br><strong>Power:</strong> Rune's Power, this determines the difficulty and length of Empowering and Binding phases<br><strong>Permanent Effect:</strong> Here is described Rune's effect if Rune was Engraved as Permanent. Unless stated otherwise, this effect can be activated and deactivated by holder at will and counts as a Free Action<br><strong>Temporary Effect:</strong> Effect of the rune if it was Engraved as Temporary. Unless stated otherwise, it can be activated as a Free Action, but only once. When the Rune's effect ends, Rune disappears and Item receives 1 Damage (Armour receives 1 Damage on random location).</p><p></p><h3>Rune of Cleaving</h3><p><strong>Type:</strong> Weapon<br><strong>Power:</strong> 3<br><strong>Permanent Effect:</strong> Attacks made with a weapon engraved with this Rune deal +1 Damage.<br><strong>Temporary Effect:</strong> As Permanent Effect, but it lasts only for 1 minute.</p><h3>Rune of Fire</h3><p><strong>Type:</strong> Weapon<br><strong>Power:</strong> 5<br><strong>Permanent Effect:</strong> Wielder of a weapon engraved with this Rune can command it to burst into flames. Weapon illuminates area around wielder like a @UUID[Compendium.forien-armoury.forien-armoury.Item.l7KTze1BpfCsW5qn]{Torch}. Additionally, any time a target hit with this weapon suffers a Critical Hit, he receices an additional @Condition[Ablaze] Condition.<br><strong>Temporary Effect:</strong> As Permanent Effect, but it lasts only for 1 minute.</p><h3>Rune of Fury</h3><p><strong>Type:</strong> Weapon<br><strong>Power:</strong> 5<br><strong>Permanent Effect:</strong> Wielder of a weapon engraved with this Rune gains a @UUID[Compendium.wfrp4e-core.talents.Item.BlHVzfs0Ow6IYEDw]{Furious Assault} talent.<br><strong>Temporary Effect:</strong> As Permanent Effect, but it lasts only for 1 minute.</p><h3>Rune of Grudges</h3><p><strong>Type:</strong> Weapon<br><strong>Power:</strong> 4<br><strong>Permanent Effect:</strong> Character wielding weapon Engraved with this Rune can, on the first Round of Combat, nominate an enemy as the Target of this Rune. For the remainder of the Combat, you can reroll all failed attacks against the Target.<br><strong>Temporary Effect:</strong> As Permanent Effect, but it lasts only for 1 minute.</p><h3>Rune of Might</h3><p><strong>Type:</strong> Weapon<br><strong>Power:</strong> 5<br><strong>Permanent Effect:</strong> Attacks made with a weapon engraved with this Rune against a target with Toughness Bonus 5 or more are treated as if the attacker had double Strength Bonus.<br><strong>Temporary Effect:</strong> As Permanent Effect, but it lasts only for 1 minute.</p><h3>Rune of Speed</h3><p><strong>Type:</strong> Weapon<br><strong>Power:</strong> 4<br><strong>Permanent Effect:</strong> If the wielder is not @Condition[Surprised] and has this weapon in hands at the start of the Combat, he gains +1d10 bonus to his combat initiative score.<br><strong>Temporary Effect:</strong> As Permanent Effect, but can only be activated once.</p><h3>Rune of Striking</h3><p><strong>Type:</strong> Weapon<br><strong>Power:</strong> 4<br><strong>Permanent Effect:</strong> Weapon Engraved with this Rune grants whoever wields it additional +10 Weapon Skill.<br><strong>Temporary Effect:</strong> As Permanent Effect, but it lasts only for 1 minute.</p><h3>Rune of Durability</h3><p><strong>Type:</strong> Weapon<br><strong>Power:</strong> 3<br><strong>Permanent Effect:</strong> Weapon Engraved with this Rune gains Unbreakable Quality.<br><strong>Temporary Effect:</strong> As Permanent Effect, but it lasts only for 1 minute.</p>"
  },
  "video": {
    "controls": true,
    "volume": 0.5
  },
  "src": null,
  "system": {},
  "ownership": {
    "default": -1,
    "aDepqlKkeOa13DWo": 3
  },
  "flags": {},
  "_stats": {
    "systemId": "wfrp4e",
    "systemVersion": "6.5.9",
    "coreVersion": "11.304",
    "createdTime": 1688254907055,
    "modifiedTime": 1688474845017,
    "lastModifiedBy": "ZJyAmf2sKocHG1ud"
  },
  "_key": "!journal.pages!u2f4n9KXYBmBvZw3.MJssx3cDKIqZVdXq"
}